606Assi2 (1)/environment/hw-rails-intro-master/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
    def index
      @all_boxes = ['G', 'PG', 'PG-13', 'R']
      @movies = Movie.order(params[:sort])  #For part1
      @sort = params[:sort] || session[:sort]
      @selected_boxes = params[:ratings] || session[:ratings]

      #For part3
      if (params[:sort] == session[:sort]) == false
        if(params[:ratings] == session[:ratings]) == false
          params[:ratings] = @selected_boxes
          session[:ratings] = @selected_boxes
          params[:sort] = @sort
          session[:sort] = @sort
          flash.keep
          redirect_to movies_path(:sort=>params[:sort], :ratings =>params[:ratings])
        end
      end

      #For part2
      @boxes = {}
      for rating in @all_boxes
        @boxes[rating] = @selected_boxes.nil?
        @selected_boxes.keys.include?(rating)
      end

      @movies = Movie.order @sort
      if @selected_boxes
        @movies = Movie.where(:rating => @selected_boxes.keys).order @sort